/*
5.1 Для однієї з таблиць, що містить обмеження цілісності зовнішнього ключа, виконати
	команду зміни значення колонки зовнішнього ключа на значення, яке відсутнє в колонці
	первинного ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.
*/
UPDATE employee 
    SET pharmacy_id = 5 
    WHERE pharmacy_id = 2;
/*
Error report -
ORA-02291: нарушено ограничение целостности (MALTSEV.EMP_PHARMACY_FK) - исходный ключ не найден
*/

/*
5.2 Повторити рішення завдання 5.1, але таке, що не призводить до порушення цілісності
	зовнішнього ключа.
*/
UPDATE employee 
    SET pharmacy_id = 3 
    WHERE pharmacy_id = 2;

/*
5.3 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, пов'язане з
	колонкою зовнішнього ключа іншої таблиці, виконати одну команду видалення рядка зі значенням
	колонки первинного ключа, що є в колонці зовнішнього ключа іншої таблиці. Перевірити реакцію
	СКБД видалення.
*/
DELETE FROM medicine
    WHERE medicine_id = 1;
/*
Error report -
ORA-02292: нарушено ограничение целостности (MALTSEV.ORDER_MED_FK) - обнаружена порожденная запись
*/

/*
5.4 Повторити рішення завдання 5.3, але таке, що не призводить до порушення цілісності
	зовнішнього ключа.
*/
DELETE FROM medicine
    WHERE medicine_id = 3;

/*
5.5 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, виконати
	команду зміни значення колонки первинного ключа на значення, яке відсутнє у колонці
	зовнішнього ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.
*/
UPDATE medicine
    SET medicine_id = 10
    WHERE medicine_id = 1;
/*
Error report -
ORA-02292: нарушено ограничение целостности (MALTSEV.ORDER_MED_FK) - обнаружена порожденная запись
*/

/*
5.6 Повторити рішення завдання 5.5, але таке, що не призводить до порушення цілісності
	зовнішнього ключа.
*/
UPDATE medicine
    SET medicine_id = 4
    WHERE medicine_id = 1;