/*
6.1 Для однієї з таблиць створити команду отримання кількості рядків таблиці.
*/
SELECT COUNT (medicine_id) 
	FROM medicine;
/*
	COUNT(MED_ID)
1	2
*/

/*
6.2 Для однієї з таблиць створити команду отримання суми значень однієї з цілих
	колонок.
*/
SELECT SUM(price)
	FROM medicine;
/*
	SUM(PRICE)
1	418,4
*/

/*
6.3 Для однієї з таблиць створити команду отримання статистики появи значень однієї з
	колонок у таблиці, наприклад:
		- значення 1, кількість появи значення 1
		- значення 2, кількість появи значення 2
*/
SELECT total, COUNT(*)
    FROM order_
    GROUP BY total;
/*
	TOTAL	COUNT(*)
1	240,5	3
2	177,9	1
*/

/*
6.4 Модифікувати рішення попереднього завдання так, щоб у відповіді були
	відфільтровані рядки з урахуванням заданої умови, що включає використану функцію агрегації.
*/
SELECT total, COUNT(*)
    FROM order_
    GROUP BY total
    HAVING total >= 200;
/*
	TOTAL	COUNT(*)
1	240,5	3
*/